#pragma once

static char mapdata[AllStageNum][mapheight][mapwidth] = {
{
	"..................gggggggggggggggggggggggg.......................................................iiiiiiiin...........................gg..............",
	".........................................n...............................................................n...........................gg..............",
	".........................................n...............................................................n...........................gg..............",
	".........................................n...............................................................n...........................gg..............",
	".............................ggggggggggggg............................................?.........gggg.....ng..........................gg..............",
	"...........................ggg.................................................................g..........g................iii.......gg..............",
	".................cc......ggg..............................iii.................................gg..........ggggggggggggggggggggggggggggg..............",
	"................c..c...gggg.............i..........i..i......i..............................ngg......................................ng..............",
	".........?.?.!.cc.gggggg................................ng....i.............................ng..............c........................ng..............",
	"...............c...................cc...................ngg....i.......!....................ng..........cc.c.c.......................ng..............",
	"i.............cc..................c..c..................ngggc.................giiiigggggggggggiii......c..c...c......................ng..............",
	"......cc......c..................c..gggg...g......gggggggggggc................g....gggggggg......g.....c.ng....c.....................ng..............",
	".....c..c........................c..gggg...g......ggggggggggggc...............g....gggggggg.k....g.......ng....c.....................ng..............",
	".....c.ggggggggg.............cccc...gggg...g......gggggggggggggccccc..........g....gggggggg......g.......ng....c.....................ng..............",
	"gggggggggggggggggggggggggggggggggggggggg...g......ggggggggggggg....ggggggggggggggg.gggggggg.gg...gggggggggg....gggggggggg.ggggggggggggggggggggggggggg"
},
};

//map関連の初期化関数
void MapInitialize();

//map1にmap2をコピーする関数
void MapCpy(char map1[mapheight][mapwidth], const char map2[mapheight][mapwidth]);

//x,y座標を与えるとmap上のその座標に何があるかを返す関数
int IsAbleToGoXY(int x, int y, map_t map);

//プレイヤーが指定された方向と距離に進めるだけ進む関数　進んだ距離を返す
int PlayerGoWhileAble(player_t* player, direction dire, map_t map, int z);

//マップの変化の処理をする関数
void MapUpdate(player_t *player, map_t *map);

//マップの描画をする関数
void MapDraw(player_t player, int camera_x, int camera_y, map_t map);